# CP Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..CP Property
SymbolTypeId Class See Also
---
Symbol cP, indicating unit Centipoises.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CP { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CP As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CP {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace